Test Cases/EDISS_Project5_EC2_650_summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,KB/sec,Avg. Bytes
Admin Login,650,3770,227,11949,2083.00,0.00%,30.7,13.86,462.6
Buy Product,650,17145,488,28292,5698.56,0.00%,16.2,5.91,372.6
Update Contact Info,650,9379,1370,19774,1926.50,0.00%,12.0,4.29,366.7
Modify Product,650,9189,2028,21389,1463.58,0.00%,9.7,3.53,373.6
View Users,650,7836,290,16161,2052.97,0.00%,9.0,4.22,477.5
Get Products,650,5482,158,43470,2901.80,0.00%,7.2,2.58,365.6
Get Orders,650,4376,27,110960,5512.42,0.00%,4.1,1.67,418.6
TOTAL,4550,8168,27,110960,5475.15,0.00%,26.0,10.30,405.3