Test Cases/summary_local_4000.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,KB/sec,Avg. Bytes
JDBC Test:JDBC Query - Get product,16000,1304,0,7811,2058.79,0.00%,138.3,123.87,917.0
JDBC Test:JDBC Query - Modify Product,16000,1259,16,8059,1580.95,0.00%,78.3,0.69,9.0
TOTAL,32000,1282,0,8059,1835.62,0.00%,156.5,70.77,463.0